'use strict';

// formServices - id всей формы
// formServicesInner - Контейнер куда помещаются все Селекты или Рэдио одного блока
let formServices = document.getElementById("formServices");
let formServicesInner = formServices.querySelector(".form-services_inner");

let htmlSum = document.getElementById('sum').querySelector('span');
let htmlSumDiscounted = document.getElementById('sum').querySelectorAll('span')[1];
let htmlTotalSum = document.getElementById('totalSum').querySelector('span');
let htmlTotalSumDiscounted = document.getElementById('totalSum').querySelectorAll('span')[1];

let tableServices = document.getElementById("tableServices");
let table = tableServices.querySelector("table");

// nameServices - [Object] - Наименование услуги и формат(размер)
// pageSizes - [Object] -Объект размеров (формата носителя)
// typePapers - [Object] - Тип бумаги
// weightPapers - [Object] - Плотность бумаги
// typeSurfaces - [Object] - Тип поверхности
// printColors  - [Object] - Цвет печати
// surfaceColors - [Object] - Цвет поверхности
//fillPercents - [Object] - % заполнения чернилами (тонером) на бумаге
// dpiQlts - [Onject] - Качество сканирования, dpi
//pagesPerSheetForBlack
//pagesPerSheetForColor

let nameServices,
    pageSizes,
    typePapers,
    weightPapers,
    typeSurfaces,
    printColors,
    surfaceColors,
    fillPercents,
    dpiQlts,
    pagesPerSheetForBlack,
    pagesPerSheetForColor;

// selectService - [String] - Название выбранной услуги
// selectSize - [String] - Выбранный размер
// selectType - [String] - Выбранный тип бумаги
// selectWeight - [String] - Выбранная плотность бумаги
// selectTypeSurface - [String] - Выбранный тип поверхности
// selectPrintColor - [String] - Выбранный цвет печати
// selectSurfaceColor - [String] - Выбранный цвет поверхности
// selectFillPercent - [String] - Выбранный процент заполнения
// selectQtyPage - [Number]
// selectQtyCopy - [Number]
// selectPagePerSheet - [Number]
// selectPrice - [Number] - Цена за единицу

let selectService,
   selectSize,
   selectType,
   selectWeight,
   selectTypeSurface,
   selectPrintColor,
   selectSurfaceColor,
   selectFillPercent,
   selectDpiQlt,
   selectQtyPage = 1,
   selectQtyCopy = 1,
   selectPagePerSheet = 1,
   selectPrice = 0;

// Все для переплета под пластиковую пружину
let SPRING_BINDINGS_VALUES = [],
      SPRING_BINDINGS_KEYS;

const SPRING_BINDINGS = {
  // Толщина переплета
  "до 1мм (до 10 листов)" : 20,
  "до 5мм (до 50 листов)" : 30,
  "до 10мм (до 100 листов)" : 40,
  "до 20мм (до 200 листов)" : 50,
  "до 30мм (до 300 листов)" : 70,
  "до 48мм (до 480 листов)" : 85
}

//Делаем массив толщин переплета из ключей объекта
SPRING_BINDINGS_KEYS = Object.keys(SPRING_BINDINGS);
//Деалем массив цен переплета из ключей объекта
for (var key in SPRING_BINDINGS) {
   SPRING_BINDINGS_VALUES.push(SPRING_BINDINGS[key]);
}
//***//

// Все для переплета под нитку
let THREAD_BINDINGS_VALUES = [],
      THREAD_BINDINGS_KEYS;

const THREAD_BINDINGS = {
  // Толщина переплета
  "до 15мм (до 150 листов)" : 40,
  "до 30мм (до 300 листов)" : 80,
  "до 50мм (до 500 листов)" : 160
}

//Делаем массив толщин переплета из ключей объекта
THREAD_BINDINGS_KEYS = Object.keys(THREAD_BINDINGS);
//Деалем массив цен переплета из ключей объекта
for (var key in THREAD_BINDINGS) {
   THREAD_BINDINGS_VALUES.push(THREAD_BINDINGS[key]);
}
//***//

// Все для переплета мягкого (с клееным каналом)
let SOFT_BINDINGS_VALUES = [],
      SOFT_BINDINGS_KEYS;

const SOFT_BINDINGS = {
  // Толщина переплета
  "до 10мм (до 100 листов)" : 70,
  "до 20мм (до 200 листов)" : 120,
  "до 40мм (до 400 листов)" : 220
}

//Делаем массив толщин переплета из ключей объекта
SOFT_BINDINGS_KEYS = Object.keys(SOFT_BINDINGS);
//Деалем массив цен переплета из ключей объекта
for (var key in SOFT_BINDINGS) {
   SOFT_BINDINGS_VALUES.push(SOFT_BINDINGS[key]);
}
//***//

// Все для переплета твердого (книжного)
let HARD_BINDINGS_VALUES = [],
      HARD_BINDINGS_KEYS;

const HARD_BINDINGS = {
  // Толщина переплета
  "до 12мм (до 100 листов)" : 120,
  "до 20мм (до 200 листов)" : 140,
  "до 30мм (до 300 листов)" : 150,
  "до 40мм (до 400 листов)" : 220,
  "до 50мм (до 500 листов)" : 290,
  "до 60мм (до 600 листов)" : 360,
  "до 70мм (до 700 листов)" : 500
}

//Делаем массив толщин переплета из ключей объекта
HARD_BINDINGS_KEYS = Object.keys(HARD_BINDINGS);
//Деалем массив цен переплета из ключей объекта
for (var key in HARD_BINDINGS) {
   HARD_BINDINGS_VALUES.push(HARD_BINDINGS[key]);
}
//***//

// Все для переплета твердого (под 3 отверстия)
let HARD_HOLE_BINDINGS_VALUES = [],
      HARD_HOLE_BINDINGS_KEYS;

const HARD_HOLE_BINDINGS = {
  // Толщина переплета
  "до 25мм (до 250 листов)" : 80
}

//Делаем массив толщин переплета из ключей объекта
HARD_HOLE_BINDINGS_KEYS = Object.keys(HARD_HOLE_BINDINGS);
//Деалем массив цен переплета из ключей объекта
for (var key in HARD_HOLE_BINDINGS) {
   HARD_HOLE_BINDINGS_VALUES.push(HARD_HOLE_BINDINGS[key]);
}
//***//

//Названия параметров формы заказа
const PARAMS = {
  nameService : "Наименование услуг:",

  bindingSize : "Формат переплета (Размер)",
  frameSize : "Размер рамки (картины):",
  pageSize : "Формат бумаги (Размер):",

  typeBinding : "Тип переплета:",
  typePaper : "Тип бумаги (носителя):",

  weightFilm : "Толщина пленки:",
  weightBinding : "Толщина переплета:",
  weightPaper : "Плотность бумаги (носителя):",

  typeCover : "Тип обложки:",
  typeSurface : "Тип поверхности:",

  printColor : "Цвет печати:",

  coverColor : "Цвет обложки:",
  surfaceColor : "Цвет поверхности (цвет бумаги):",

  fillPercent : "% заполнения чернил на листе:",

  qtyBinding : "Количество переплетов",
  qtyPage : "Количество страниц (шт):",

  qtyCopy : "Количество экземпляров (1стр. в количестве):",

  dpiQlt : "Качество сканирования (dpi):",

  pagePerSheet : "Страниц на листе:"
};
//***//


// Наименование услуги и формат(размер)
// Цена в скобках = цена печати + цена бумаги
nameServices = {
                  "Распечатка": {
                    // Формат (размер)
                    "CD/DVD диск": {
                      //Тип бумаги
                      "CD диск + печать": {
                        // Плотность
                        "(700мб)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (20 + 20)
                              }
                            }
                          }
                        }
                      },
                      //Тип бумаги
                      "DVD диск + печать": {
                        // Плотность
                        "(700мб)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (20 + 20)
                              }
                            }
                          }
                        }
                      }
                    },
                    // Формат (размер)
                    "(9х13) см": {
                      //Тип бумаги
                       "Фотобумага": {
                         // Плотность
                         "Средняя(150-190г/м2)": {
                           // Тип поверхности
                           "Матовая": {
                             // Цвет печати
                             "Цветная": {
                               // Цвет поверхности
                               "Белая": {
                                 "с картинками": 7
                               }
                             }
                           },
                           // Тип поверхности
                           "Глянцевая": {
                             // Цвет печати
                             "Цветная": {
                               // Цвет поверхности
                               "Белая": {
                                 "с картинками": 7
                               }
                             }
                           }
                         },
                         "Плотная(200-240г/м2)": {
                           // Тип поверхности
                           "Матовая": {
                             // Цвет печати
                             "Цветная": {
                               // Цвет поверхности
                               "Белая": {
                                 "с картинками": 8
                               }
                             }
                           },
                           // Тип поверхности
                           "Глянцевая": {
                             // Цвет печати
                             "Цветная": {
                               // Цвет поверхности
                               "Белая": {
                                 "с картинками": 8
                               }
                             }
                           }
                         }
                       }
                    },
                    "А6 (10х15) см": {
                      "Фотобумага": {
                          // Плотность
                          "Средняя(150-190г/м2)": {
                            // Тип поверхности
                            "Матовая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 7
                                }
                              }
                            },
                            // Тип поверхности
                            "Глянцевая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 7
                                }
                              }
                            }
                          },
                          "Плотная(200-240г/м2)": {
                            // Тип поверхности
                            "Матовая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 8
                                }
                              }
                            },
                            // Тип поверхности
                            "Глянцевая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 8
                                }
                              }
                            }
                          }
                      }
                    },
                    "(13х18) см": {
                      "Фотобумага": {
                          // Плотность
                          "Средняя(150-190г/м2)": {
                            // Тип поверхности
                            "Матовая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 14
                                }
                              }
                            },
                            // Тип поверхности
                            "Глянцевая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 14
                                }
                              }
                            }
                          },
                          "Плотная(200-240г/м2)": {
                            // Тип поверхности
                            "Матовая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 16
                                }
                              }
                            },
                            // Тип поверхности
                            "Глянцевая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 16
                                }
                              }
                            }
                          }
                      }
                    },
                    "А5 (15х21) см": {
                      "Фотобумага": {
                          // Плотность
                          "Средняя(150-190г/м2)": {
                            // Тип поверхности
                            "Матовая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 14
                                }
                              }
                            },
                            // Тип поверхности
                            "Глянцевая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 14
                                }
                              }
                            }
                          },
                          "Плотная(200-240г/м2)": {
                            // Тип поверхности
                            "Матовая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 16
                                }
                              }
                            },
                            // Тип поверхности
                            "Глянцевая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": 16
                                }
                              }
                            }
                          }
                      }
                    },
                    "А4 (21х30) см": {
                      // Тип бумаги
                      "Простая": {
                        // Плотнсоть
                        "Тонкая(80г/м2)": {
                          //Тип прверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "текст": 3,
                                "с картинками": 3
                              },
                              // Цвет поверхности
                              "Цветная": {
                                "текст": (3 + 2),
                                "с картинками": (3 + 2)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "текст": 8,
                                "с картинками": 10
                              }
                            }
                          }
                        },
                        "Плотная(150-190г/м2)": {
                          // тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "текст": (3 + 3),
                                "с картинками": (3 + 3)
                              },
                              // Цвет поверхности
                              "Цветная": {
                                "текст": (3 + 4),
                                "с картинками": (3 + 4)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "текст": (8 + 3),
                                "с картинками": (10 + 3)
                              }
                            }
                          }
                        }
                      },
                      // Тип бумаги
                      "Фотобумага": {
                        "Тонкая(105-128г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 17
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 17
                              }
                            }
                          }
                        },
                        // Плотность
                        "Средняя(150-190г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 19
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 19
                              }
                            }
                          }
                        },
                        "Плотная(200-240г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 22
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 22
                              }
                            }
                          }
                        }
                      },
                      // Тип бумаги
                      "Самоклейка": {
                        "Тонкая(80г/м2)": {
                          "Простая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 19
                              }
                            }
                          }
                        },
                        "Средняя(115-135г/м2)": {
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 22
                              }
                            }
                          },
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 34
                              }
                            }
                          },
                          "Прозрачная": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 45
                              }
                            }
                          }
                        }
                      },
                      // Тип бумаги
                      "Холст": {
                        "Средняя(150-190г/м2)": {
                          "Хлопок натуральный": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 85
                              }
                            }
                          }
                        }
                      },
                      // Тип бумаги
                      "Слайд": {
                         "Средняя(135-190г/м2)": {
                           "Прозрачная(ый)": {
                             // Цвет печати
                             "Ч/б": {
                               // Цвет поверхности
                               "Белая": {
                                 "с картинками": 23
                               }
                             },
                             "Цветная": {
                               // Цвет поверхности
                               "Белая": {
                                 "с картинками": 32
                               }
                             }
                           }
                         }
                      }
                    },
                    "А3 (30х42) см": {
                      // Тип бумаги
                      "Простая": {
                        // Плотнсоть
                        "Тонкая(80г/м2)": {
                          //Тип прверхности
                          "Простая": {
                              // Цвет печати
                              "Ч/б": {
                                  // Цвет поверхности
                                  "Белая": {
                                    "текст": 5,
                                    "с картинками": 7
                                  }
                              },
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "текст": (16 + 2),
                                  "с картинками": (20 + 2)
                                }
                              }
                          }
                        },
                        "Плотная(150-190г/м2)": {
                          // тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "текст": (5 + 6),
                                "с картинками": (7 + 6)
                              },
                              // Цвет поверхности
                              "Цветная": {
                                "текст": (5 + 8),
                                "с картинками": (7 + 8)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "текст": (16 + 6),
                                "с картинками": (20 + 6)
                              }
                            }
                          }
                        }
                      },
                      // Тип бумаги
                      "Фотобумага": {
                        // Плотность
                        "Средняя(100-170г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (20 + 20)
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (20 + 22)
                              }
                            }
                          }
                        },
                        "Плотная(180-240г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (20 + 26)
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (20 + 28)
                              }
                            }
                          }
                        }
                      },
                      // Тип бумаги
                      "Самоклейка": {
                        "Средняя(115-135г/м2)": {
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 0
                              }
                            }
                          },
                          "Прозрачная": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 90
                              }
                            }
                          }
                        }
                      },
                      // Тип бумаги
                      "Холст": {
                        "Средняя(150-190г/м2)": {
                          "Хлопок натуральный": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 165
                              }
                            }
                          }
                        }
                      },
                      "Калька": {
                        "Тонкая(70г/м2)": {
                          // Тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (16 + 60)
                              }
                            },
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (20 + 60)
                              }
                            }
                          }
                        }
                      }
                    },
                    // Формат бумаги (Размер)
                    "А2 (42х60) см": {
                      // Тип бумаги
                      "Простая": {
                        // Плотнсоть
                        "Тонкая(80г/м2)": {
                          //Тип прверхности
                          "Простая": {
                              // Цвет печати
                              "Ч/б": {
                                  // Цвет поверхности
                                  "Белая": {
                                    "текст": (10 + 7),
                                    "с картинками": (25 + 7)
                                  }
                              },
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "текст": (30 + 7),
                                  "с картинками": (50 + 7)
                                }
                              }
                          }
                        },
                        "Плотная(150-190г/м2)": {
                          // тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "текст": (10 + 13),
                                "с картинками": (25 + 13)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "текст": (30 + 13),
                                "с картинками": (50 + 13)
                              }
                            }
                          }
                        }
                      },
                      // Тип бумаги
                      "Фотобумага": {
                        // Плотность
                        "Плотная(140-190г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (50 + 40)
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (50 + 45)
                              }
                            }
                          }
                        }
                      }
                    },
                    "А1 (60х84) см": {
                        // Тип бумаги
                        "Простая": {
                          // Плотнсоть
                          "Тонкая(80г/м2)": {
                            //Тип прверхности
                            "Простая": {
                                // Цвет печати
                                "Ч/б": {
                                    // Цвет поверхности
                                    "Белая": {
                                      "текст": (20 + 14),
                                      "с картинками": (50 + 14)
                                    }
                                },
                                // Цвет печати
                                "Цветная": {
                                  // Цвет поверхности
                                  "Белая": {
                                    "текст": (60 + 14),
                                    "с картинками": (100 + 14)
                                  }
                                }
                            }
                          },
                          "Плотная(150-190г/м2)": {
                            // тип поверхности
                            "Простая": {
                              // Цвет печати
                              "Ч/б": {
                                // Цвет поверхности
                                "Белая": {
                                  "текст": (20 + 15),
                                  "с картинками": (50 + 15)
                                }
                              },
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "текст": (60 + 15),
                                  "с картинками": (100 + 15)
                                }
                              }
                            }
                          }
                        },
                        // Тип бумаги
                        "Фотобумага": {
                          // Плотность
                          "Плотная(140-190г/м2)": {
                            // Тип поверхности
                            "Матовая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": (100 + 80)
                                }
                              }
                            },
                            // Тип поверхности
                            "Глянцевая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": (100 + 90)
                                }
                              }
                            }
                          }
                        }
                    },
                    "А0 (84х119) см": {
                        // Тип бумаги
                        "Простая": {
                          // Плотнсоть
                          "Тонкая(80г/м2)": {
                            //Тип прверхности
                            "Простая": {
                                // Цвет печати
                                "Ч/б": {
                                    // Цвет поверхности
                                    "Белая": {
                                      "текст": (40 + 25),
                                      "с картинками": (100 + 25)
                                    }
                                },
                                // Цвет печати
                                "Цветная": {
                                  // Цвет поверхности
                                  "Белая": {
                                    "текст": (120 + 25),
                                    "с картинками": (200 + 25)
                                  }
                                }
                            }
                          },
                          "Плотная(150-190г/м2)": {
                            // тип поверхности
                            "Простая": {
                              // Цвет печати
                              "Ч/б": {
                                // Цвет поверхности
                                "Белая": {
                                  "текст": (40 + 38),
                                  "с картинками": (100 + 38)
                                }
                              },
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "текст": (120 + 38),
                                  "с картинками": (200 + 38)
                                }
                              }
                            }
                          }
                        },
                        // Тип бумаги
                        "Фотобумага": {
                          // Плотность
                          "Плотная(140-190г/м2)": {
                            // Тип поверхности
                            "Матовая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": (200 + 195)
                                }
                              }
                            },
                            // Тип поверхности
                            "Глянцевая": {
                              // Цвет печати
                              "Цветная": {
                                // Цвет поверхности
                                "Белая": {
                                  "с картинками": (200 + 220)
                                }
                              }
                            }
                          }
                        }
                    },
                    "А0++ (91х119) см": {
                        "нет в наличии": {},
                        "": {}
                    }
                  },


                  "Сканирование": {
                    "А4 (21х30) см": {
                      //Тип бумаги
                      "Простая": {
                        // Плотность
                        "Тонкая(80г/м2)": {
                          // Тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 6,
                                "до 600": 8
                              }
                            },
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 7,
                                "до 600": 10,
                                "до 1200": 20,
                                "до 2400": 50
                              }
                            }
                          }
                        }
                      }
                    },

                    "А3 (30х42) см": {
                      //Тип бумаги
                      "Простая": {
                        // Плотность
                        "Тонкая(80г/м2)": {
                          // Тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 12
                              }
                            },
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 15
                              }
                            }
                          }
                        }
                      }
                    },

                    "А2 (42х60) см": {
                      //Тип бумаги
                      "Простая": {
                        // Плотность
                        "Тонкая(80г/м2)": {
                          // Тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 25
                              }
                            },
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 40
                              }
                            }
                          }
                        }
                      }
                    },

                    "А1 (60х84) см": {
                      //Тип бумаги
                      "Простая": {
                        // Плотность
                        "Тонкая(80г/м2)": {
                          // Тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 55
                              }
                            },
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 85
                              }
                            }
                          }
                        }
                      }
                    },

                    "А0 (84х119) см": {
                      //Тип бумаги
                      "Простая": {
                        // Плотность
                        "Тонкая(80г/м2)": {
                          // Тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 130
                              }
                            },
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 200
                              }
                            }
                          }
                        }
                      }
                    },

                    "B0 (1067х1414) см": {
                      //Тип бумаги
                      "Простая": {
                        // Плотность
                        "Тонкая(80г/м2)": {
                          // Тип поверхности
                          "Простая": {
                            // Цвет сканирования
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 230
                              }
                            },
                            // Цвет сканирования
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Качество сканирование, dpi
                                "до 300": 350
                              }
                            }
                          }
                        }
                      }
                    }
                  },


                  "Ксерокс": {
                    "А4 (21х30) см": {
                      // Тип бумаги
                      "Простая": {
                        // Плотнсоть
                        "Тонкая(80г/м2)": {
                          //Тип прверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 3
                              },
                              // Цвет поверхности
                              "Цветная": {
                                "с картинками": (3 + 2)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (10 + 7)
                              }
                            }
                          }
                        },
                        "Плотная(150-190г/м2)": {
                          // тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (3 + 3)
                              },
                              // Цвет поверхности
                              "Цветная": {
                                "с картинками": (3 + 4)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (10 + 7 + 3)
                              }
                            }
                          }
                        }
                      },
                      // Тип бумаги
                      "Фотобумага": {
                        "Тонкая(105-128г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (17 + 10)
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (17 + 10)
                              }
                            }
                          }
                        },
                        // Плотность
                        "Средняя(150-190г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (19 + 10)
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (19 + 10)
                              }
                            }
                          }
                        },
                        "Плотная(200-240г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (22 + 10)
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (22 + 10)
                              }
                            }
                          }
                        }
                      }
                    },

                    "А3 (30х42) см": {
                      // Тип бумаги
                      "Простая": {
                        // Плотнсоть
                        "Тонкая(80г/м2)": {
                          //Тип прверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 5
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "с картинками": (20 + 2 + 15)
                              }
                            }
                          }
                        },
                        "Плотная(150-190г/м2)": {
                          // тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага
                                "с картинками": (5 + 6)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "с картинками": (20 + 6 + 15)
                              }
                            }
                          }
                        }
                      },
                      // Тип бумаги
                      "Фотобумага": {
                        // Плотность
                        "Средняя(100-170г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "с картинками": (20 + 20 + 15)
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "с картинками": (20 + 22 + 15)
                              }
                            }
                          }
                        },
                        "Плотная(180-240г/м2)": {
                          // Тип поверхности
                          "Матовая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "с картинками": (20 + 26 + 15)
                              }
                            }
                          },
                          // Тип поверхности
                          "Глянцевая": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "с картинками": (20 + 28 + 15)
                              }
                            }
                          }
                        }
                      }
                    },

                    "А2 (42х60) см": {
                      // Тип бумаги
                      "Простая": {
                        // Плотнсоть
                        "Тонкая(80г/м2)": {
                          //Тип прверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "текст": (10 + 7 + 25),
                                "с картинками": (25 + 7 + 25)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "с картинками": (50 + 7 + 40)
                              }
                            }
                          }
                        },
                        "Плотная(150-190г/м2)": {
                          // тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "текст": (10 + 13 + 25),
                                "с картинками": (25 + 13 + 25)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "с картинками": (50 + 13 + 40)
                              }
                            }
                          }
                        }
                      }
                    },

                    "А1 (60х84) см": {
                      // Тип бумаги
                      "Простая": {
                        // Плотнсоть
                        "Тонкая(80г/м2)": {
                          //Тип прверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "текст": (20 + 14 + 55),
                                "с картинками": (50 + 14 + 55)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "с картинками": (100 + 14 + 85)
                              }
                            }
                          }
                        },
                        "Плотная(150-190г/м2)": {
                          // тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "текст": (20 + 15 + 55),
                                "с картинками": (50 + 15 + 55)
                              }
                            },
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "Белая": {
                                // Печать + бумага + скан
                                "с картинками": (100 + 15 + 85)
                              }
                            }
                          }
                        }
                      }
                    },

                    "А0 (84х119) см": {
                      "": {},
                      "можно частями": {}
                    },

                    "А0++ (91х119) см": {
                      "": {},
                      "можно частями": {}
                    }
                  },


                  "Ризограф": {
                    "А4 (21х30) см": {
                      // Тип бумаги
                      "Простая": {
                        // Плотнсоть
                        "Тонкая(80г/м2)": {
                          //Тип прверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 2
                              },
                              // Цвет поверхности
                              "Цветная": {
                                // Печать + бумага
                                "с картинками": (2 + 2)
                              }
                            }
                          }
                        },
                        "Плотная(150-190г/м2)": {
                          // тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (2 + 3)
                              },
                              // Цвет поверхности
                              "Цветная": {
                                "с картинками": (2 + 4)
                              }
                            }
                          }
                        }
                      }
                    },

                    "А3 (30х42) см": {
                      // Тип бумаги
                      "Простая": {
                        // Плотнсоть
                        "Тонкая(80г/м2)": {
                          //Тип прверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": 4.5
                              }
                            }
                          }
                        },
                        "Плотная(150-190г/м2)": {
                          // тип поверхности
                          "Простая": {
                            // Цвет печати
                            "Ч/б": {
                              // Цвет поверхности
                              "Белая": {
                                "с картинками": (4.5 + 6)
                              },
                              // Цвет поверхности
                              "Цветная": {
                                "с картинками": (4.5 + 8)
                              }
                            }
                          }
                        }
                      }
                    }
                  },


                  "Переплет": {
                    "А5 (15х21) см": {
                      //Тип переплета
                      "Под пластиковую пружину (брошюровка)": function() {
                        let obj = {};
                        for (var i = 0; i < SPRING_BINDINGS_KEYS.length; i++) {
                          obj[SPRING_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Пластик": {
                              //
                              "": {
                                // Цвет обложки
                                "Цветная": {
                                  "": SPRING_BINDINGS_VALUES[i]
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }(),
                      //Тип переплета
                      "Под нитку": function() {
                        let obj = {};
                        for (var i = 0; i < THREAD_BINDINGS_KEYS.length; i++) {
                          obj[THREAD_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Без обложки": {
                              //
                              "": {
                                // Цвет обложки
                                "": {
                                  "": THREAD_BINDINGS_VALUES[i]
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }(),
                      //Тип переплета
                      "Мягкий (с клеенным каналом)": function() {
                        let obj = {};
                        for (var i = 0; i < SOFT_BINDINGS_KEYS.length; i++) {
                          obj[SOFT_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Картон": {
                              //
                              "": {
                                // Цвет обложки
                                "Белый": {
                                  "": SOFT_BINDINGS_VALUES[i]
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }()
                    },

                    "А4 (21х30) см": {
                      //Тип переплета
                      "Под пластиковую пружину (брошюровка)": function() {
                        let obj = {};
                        for (var i = 0; i < SPRING_BINDINGS_KEYS.length; i++) {
                          obj[SPRING_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Пластик": {
                              //
                              "": {
                                // Цвет обложки
                                "Цветная": {
                                  "": SPRING_BINDINGS_VALUES[i]
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }(),
                      //Тип переплета
                      "Под нитку": function() {
                        let obj = {};
                        for (var i = 0; i < THREAD_BINDINGS_KEYS.length; i++) {
                          obj[THREAD_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Без обложки": {
                              //
                              "": {
                                // Цвет обложки
                                "": {
                                  "": THREAD_BINDINGS_VALUES[i]
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }(),
                      //Тип переплета
                      "Мягкий (с клеенным каналом)": function() {
                        let obj = {};
                        for (var i = 0; i < SOFT_BINDINGS_KEYS.length; i++) {
                          obj[SOFT_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Картон": {
                              //
                              "": {
                                // Цвет обложки
                                "Белый или цветной": {
                                  "": SOFT_BINDINGS_VALUES[i]
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }(),
                      //Тип переплета
                      "Твердый (книжный)": function() {
                        let obj = {};
                        for (var i = 0; i < HARD_BINDINGS_KEYS.length; i++) {
                          obj[HARD_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Твердая": {
                              //
                              "": {
                                // Цвет обложки
                                "Цветная": {
                                  "": HARD_BINDINGS_VALUES[i]
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }(),
                      //Тип переплета
                      "Твердый (под 3 отверстия)": function() {
                        let obj = {};
                        for (var i = 0; i < HARD_HOLE_BINDINGS_KEYS.length; i++) {
                          obj[HARD_HOLE_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Твердая с надписью и без": {
                              //
                              "": {
                                // Цвет обложки
                                "Цветная": {
                                  "": HARD_HOLE_BINDINGS_VALUES[i]
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }()
                    },

                    "А3 (30х42) см": {
                      //Тип переплета
                      "Под пластиковую пружину (брошюровка)": function() {
                        let obj = {};
                        for (var i = 0; i < SPRING_BINDINGS_KEYS.length; i++) {
                          obj[SPRING_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Пластик": {
                              //
                              "": {
                                // Цвет обложки
                                "Безцветная": {
                                  "": SPRING_BINDINGS_VALUES[i] + 16
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }(),
                      //Тип переплета
                      "Под нитку": function() {
                        let obj = {};
                        for (var i = 0; i < THREAD_BINDINGS_KEYS.length; i++) {
                          obj[THREAD_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Без обложки": {
                              //
                              "": {
                                // Цвет обложки
                                "": {
                                  "": THREAD_BINDINGS_VALUES[i] * 2
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }(),
                      //Тип переплета
                      "Мягкий (с клеенным каналом)": function() {
                        let obj = {};
                        for (var i = 0; i < SOFT_BINDINGS_KEYS.length; i++) {
                          obj[SOFT_BINDINGS_KEYS[i]] = {
                            // Тип обложки
                            "Картон": {
                              //
                              "": {
                                // Цвет обложки
                                "Белый или цветной": {
                                  "": SOFT_BINDINGS_VALUES[i] * 2
                                }
                              }
                            }
                          };
                        }
                        return obj;
                      }()
                    }
                  },


                  "Ламинирование": {
                    "A7 (7x10 см)": {
                      //Тип бумаги
                      "": {
                        // Плотность
                        "Средняя (75-80мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 12
                              }
                            }
                          }
                        },
                        // Плотность
                        "Плотная (175мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 16
                              }
                            }
                          }
                        }
                      }
                    },
                    "А6 (10х15) см": {
                      //Тип бумаги
                      "": {
                        // Плотность
                        "Средняя (75-80мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 15
                              }
                            }
                          }
                        },
                        // Плотность
                        "Плотная (175мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 20
                              }
                            }
                          }
                        }
                      }
                    },
                    "А5 (15х21) см": {
                      //Тип бумаги
                      "": {
                        // Плотность
                        "Средняя (75-80мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 20
                              }
                            }
                          }
                        },
                        // Плотность
                        "Плотная (175мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 24
                              }
                            }
                          }
                        }
                      }
                    },
                    "А4 (21х30) см": {
                      //Тип бумаги
                      "": {
                        // Плотность
                        "Средняя (75-80мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 24
                              }
                            }
                          }
                        },
                        // Плотность
                        "Плотная (175мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 28
                              }
                            }
                          }
                        }
                      }
                    },
                    "А3 (30х42) см": {
                      //Тип бумаги
                      "": {
                        // Плотность
                        "Средняя (75-100мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 33
                              }
                            }
                          }
                        }
                      }
                    },
                    "А2 (42х60) см": {
                      //Тип бумаги
                      "": {
                        // Плотность
                        "Средняя (50-80мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 67
                              }
                            }
                          }
                        }
                      }
                    },
                    "А1 (60х84) см": {
                      //Тип бумаги
                      "": {
                        // Плотность
                        "Средняя (50-80мкм)": {
                          // Тип поверхности
                          "глянец/мат": {
                            // Цвет печати
                            "": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 119
                              }
                            }
                          }
                        }
                      }
                    }
                  },


                  "Натяжка на подрамник": {
                    "А4 (21х30) см": {
                      //Тип бумаги
                      "Холст": {
                        // Плотность
                        "Плотная (190-240г/м2)": {
                          // Тип поверхности
                          "": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 315
                              }
                            }
                          }
                        }
                      }
                    },
                    "30x30 см": {
                      //Тип бумаги
                      "Холст": {
                        // Плотность
                        "Плотная (190-240г/м2)": {
                          // Тип поверхности
                          "": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 400
                              }
                            }
                          }
                        }
                      }
                    },
                    "А3 (30х42) см": {
                      //Тип бумаги
                      "Холст": {
                        // Плотность
                        "Плотная (190-240г/м2)": {
                          // Тип поверхности
                          "": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 410
                              }
                            }
                          }
                        }
                      }
                    },
                    "40x50 см": {
                      //Тип бумаги
                      "Холст": {
                        // Плотность
                        "Плотная (190-240г/м2)": {
                          // Тип поверхности
                          "": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 570
                              }
                            }
                          }
                        }
                      }
                    },
                    "А2 (42х60) см": {
                      //Тип бумаги
                      "Холст": {
                        // Плотность
                        "Плотная (190-240г/м2)": {
                          // Тип поверхности
                          "": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 675
                              }
                            }
                          }
                        }
                      }
                    },
                    "50x60 см": {
                      //Тип бумаги
                      "Холст": {
                        // Плотность
                        "Плотная (190-240г/м2)": {
                          // Тип поверхности
                          "": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 795
                              }
                            }
                          }
                        }
                      }
                    },
                    "50x70 см": {
                      //Тип бумаги
                      "Холст": {
                        // Плотность
                        "Плотная (190-240г/м2)": {
                          // Тип поверхности
                          "": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 825
                              }
                            }
                          }
                        }
                      }
                    },
                    "А1 (60х84) см": {
                      //Тип бумаги
                      "Холст": {
                        // Плотность
                        "Плотная (190-240г/м2)": {
                          // Тип поверхности
                          "": {
                            // Цвет печати
                            "Цветная": {
                              // Цвет поверхности
                              "": {
                                //
                                "": 845
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                };


pagesPerSheetForBlack = {
                      "1 на 1": 1,
                      "2 на 1": 2,
                      "4 на 1": 4,
                      "6 на 1": 6,
                      "8 на 1": 8,
                      "9 на 1": 9,
                      "16 на 1": 16
                    };

pagesPerSheetForColor = {
                      "1 на 1": 1,
                      "2 на 1": 2,
                      "4 на 1": 4,
                      "9 на 1": 9,
                      "35 на 1": 35
                    };



function removeNextSiblingsAll(target) {

  let curentTarget;

  while((formServicesInner != target)) {
    curentTarget = target;
    target = target.parentNode;
  }
  // Удаляем всех нижних соседей текущего блока
  while(curentTarget.nextElementSibling) {
    formServicesInner.removeChild(curentTarget.nextElementSibling);
  }

}


function hiddenElement(target) {
  let curentTarget;

  while((formServicesInner != target)) {
    curentTarget = target;
    target = target.parentNode;
  }

  curentTarget.style.display = "none";
}


function insertNameServices() {
  let options = "";
  let service;

  for (service in nameServices) {
    options += '<option value="' + service + '" ' + '>' + service + '</option>';
  }

  let html = '<div class="form-group row">\
                <label class="col-12 col-md-6"> ' + PARAMS.nameService + ' </label>\
                <div class="col-12 col-md-6">\
                  <select id="nameService" class="form-control">\
                    <option value="" disabled selected> не выбрано </option>\
                    ' + options + '\
                  </select>\
                </div>\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);
}

function changeService() {
  let select = document.getElementById("nameService");
  let target = select;

  selectService = select.value;

  if (!selectService) return;

  //Очищаем все при изменении услуги
  // Находим внешний блок, в кором произошло событие
  removeNextSiblingsAll(target);
  clearResult();


  pageSizes = nameServices[selectService];

  insertPageSizes();

  document.getElementById("pageSize").onchange = function() {
    changeSize();
  }
}


function insertPageSizes() {
  let options = "";
  let size;
  let disabled = "";
  let nameLabel = selectService === "Переплет" ? PARAMS.bindingSize :
                  selectService === "Натяжка на подрамник" ? PARAMS.frameSize : PARAMS.pageSize;

  if (Object.keys(pageSizes).length > 1) {
    disabled = '<option value="" disabled selected> не выбрано </option>';
  }

  for (size in pageSizes) {
    options += '<option value="' + size + '" ' + '>' + size + '</option>';
  }

  let html = '<div class="form-group row">\
                <label class="col-12 col-md-6"> ' + nameLabel + ' </label>\
                <div class="col-12 col-md-6">\
                  <select id="pageSize" class="form-control">\
                   ' + disabled + '\
                    ' + options + '\
                  </select>\
                </div>\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);

  let target = document.getElementById('pageSize');

  if (Object.keys(pageSizes).length < 2) {
    changeSize();
    hiddenElement(target);
  }
}

function changeSize() {
  let select = document.getElementById("pageSize");
  let target = select;

  selectSize = select.value;

  if (!selectSize) return;

  //Очищаем все при изменении услуги
  // Находим внешний блок, в кором произошло событие
  removeNextSiblingsAll(target);
  clearResult();

  typePapers = pageSizes[selectSize];

  insertTypePapers();

  document.getElementById("typePaper").onchange = function() {
    changeTypePaper();
  }
}


function insertTypePapers() {
  let options = "";
  let paper;
  let disabled = "";
  let nameLabel = selectService === "Переплет" ? PARAMS.typeBinding : PARAMS.typePaper;


  if (Object.keys(typePapers).length > 1) {
    disabled = '<option value="" disabled selected> не выбрано </option>';
  }

  for (paper in typePapers) {
    options += '<option value="' + paper + '" ' + '>' + paper + '</option>'
  }

  let html = '<div class="form-group row">\
                <label class="col-12 col-md-6"> ' + nameLabel + ' </label>\
                <div class="col-12 col-md-6">\
                  <select id="typePaper" class="form-control">\
                    ' + disabled + '\
                    ' + options + '\
                  </select>\
                </div>\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);

  let target = document.getElementById('typePaper');

  if (Object.keys(typePapers).length < 2) {
    changeTypePaper();
    hiddenElement(target);
  }
}

function changeTypePaper() {
  let select = document.getElementById("typePaper");
  let target = select;

  selectType = select.value;

  // if (!selectType) return;

  //Очищаем все при изменении услуги
  // Находим внешний блок, в кором произошло событие
  removeNextSiblingsAll(target);
  clearResult();

  weightPapers = typePapers[selectType];

  insertWeightPapers();

  document.getElementById("weightPaper").onchange = function() {
    changeWeightPaper();
  }
}


function insertWeightPapers() {
  let options = "";
  let paper;
  let disabled = "";
  let nameLabel = selectService === "Переплет" ? PARAMS.weightBinding :
                  selectService === "Ламинирование" ? PARAMS.weightFilm : PARAMS.weightPaper;

  if (Object.keys(weightPapers).length > 1) {
    disabled = '<option value="" disabled selected> не выбрано </option>';
  }

  for (paper in weightPapers) {
    options += '<option value="' + paper + '" ' + '>' + paper + '</option>'
  }

  let html = '<div class="form-group row">\
                <label class="col-12 col-md-6"> ' + nameLabel + ' </label>\
                <div class="col-12 col-md-6">\
                  <select id="weightPaper" class="form-control">\
                    ' + disabled + '\
                    ' + options + '\
                  </select>\
                </div>\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);

  let target = document.getElementById('weightPaper');

  if (Object.keys(weightPapers).length < 2) {
    changeWeightPaper();
    hiddenElement(target);
  }
}

function changeWeightPaper() {
  let select = document.getElementById("weightPaper");
  let target = select;

  selectWeight = select.value;

  if (!selectWeight) return;

  //Очищаем все при изменении услуги
  // Находим внешний блок, в кором произошло событие
  removeNextSiblingsAll(target);
  clearResult();

  typeSurfaces = weightPapers[selectWeight];

  insertTypeSurfaces();

  document.getElementById("typeSurface").onchange = function() {
    changeTypeSurface();
  }
}


function insertTypeSurfaces() {
  let options = "";
  let paper;
  let html = "";
  let disabled = "";
  let nameLabel = selectService === "Переплет" ? PARAMS.typeCover : PARAMS.typeSurface;

  if (Object.keys(typeSurfaces).length > 1) {
    disabled = '<option value="" disabled selected> не выбрано </option>';
  }

  for (paper in typeSurfaces) {
    options += '<option value="' + paper + '" ' + '>' + paper + '</option>'
  }

  html = '<div class="form-group row">\
                <label class="col-12 col-md-6"> ' + nameLabel + ' </label>\
                <div class="col-12 col-md-6">\
                  <select id="typeSurface" class="form-control">\
                    ' + disabled + '\
                    ' + options + '\
                  </select>\
                </div>\
              </div>';


  formServicesInner.insertAdjacentHTML("beforeEnd", html);

  let target = document.getElementById('typeSurface');

  if (Object.keys(typeSurfaces).length < 2) {
    changeTypeSurface();
    hiddenElement(target);
  }

}

function changeTypeSurface() {
  let select = document.getElementById("typeSurface");
  let target = select;

  selectTypeSurface = select.value;

  // if (!selectTypeSurface) return;

  //Очищаем все при изменении услуги
  // Находим внешний блок, в кором произошло событие
  removeNextSiblingsAll(target);
  clearResult();

  printColors = typeSurfaces[selectTypeSurface];

  insertPrintColors();

  for (var i = 0; i < document.getElementsByName("printColor").length; i++) {
    (function(i) {
      document.getElementsByName("printColor")[i].onchange = function() {
        changePrintColor();
      }
    })(i);
  }
  //
  // for (var i = 0; i < document.getElementsByName("printColor").length; i++) {
  //   (i => {
  //     document.getElementsByName("printColor")[i].onchange = function() {
  //       changePrintColor();
  //     }
  //   })(i);
  // }

  // for (let i = 0; i < document.getElementsByName("printColor").length; i++) {
  //     document.getElementsByName("printColor")[i].onchange = function() {
  //       changePrintColor();
  //     }
  // }

}


function insertPrintColors() {
  let colors;
  let label = "";
  let checked = "";
  let nameLabel = selectService === "Переплет" ? "" : PARAMS.printColor;

  colors = Object.keys(printColors);

  if (colors.length < 2) {
    checked = 'checked';
  }

  colors.forEach( color => {
    label += '<label >' + color + '\
                <input type="radio" ' + checked + ' name="printColor" value="' + color + '">\
              </label>';
  });

  let html = '<div class="form-group row">\
                <label class="col-12 col-md-6"> ' + nameLabel + ' </label>\
                <div class="col-12 col-md-6">' + label + '\
                </div>\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);

  let target = document.getElementsByName('printColor')[0];

  if (colors.length < 2) {
    changePrintColor();
    hiddenElement(target);
  }
}

function changePrintColor() {
  let selects = document.getElementsByName("printColor");
  let target;

  for (var i = 0; i < selects.length; i++) {
    if (selects[i].checked) {
      target = selects[i]; break;
    }
  }

  selectPrintColor = target.value;

  // if (!selectPrintColor) return;

  //Очищаем все при изменении услуги
  // Находим внешний блок, в кором произошло событие
  removeNextSiblingsAll(target);
  clearResult();

  surfaceColors = printColors[selectPrintColor];

  insertSurfaceColors();

  for (let i = 0; i < document.getElementsByName("surfaceColor").length; i++) {
    document.getElementsByName("surfaceColor")[i].onchange = function() {
      changeSurfaceColor();
    }
  }
}


function insertSurfaceColors() {
  let colors;
  let label = "";
  let checked = "";
  let nameLabel = selectService === "Переплет" ? PARAMS.coverColor : PARAMS.surfaceColor;

  colors = Object.keys(surfaceColors);

  if (colors.length < 2) {
    checked = 'checked';
  }

  colors.forEach( color => {
    label += '<label >' + color + '\
                <input ' + checked + ' type="radio" name="surfaceColor" value="' + color + '">\
              </label>';
  });

  let html = '<div class="form-group row">\
                <label class="col-12 col-md-6"> ' + nameLabel + ' </label>\
                <div class="col-12 col-md-6">' + label + '\
                </div>\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);

  let target = document.getElementsByName('surfaceColor')[0];

  if (colors.length < 2) {
    changeSurfaceColor();
    hiddenElement(target);
  }

}

function changeSurfaceColor() {
  let selects = document.getElementsByName("surfaceColor");
  let target;

  for (var i = 0; i < selects.length; i++) {
    if (selects[i].checked) {
      target = selects[i]; break;
    }
  }

  selectSurfaceColor = target.value;

  // if (!selectSurfaceColor) return;

  // Объект fillPercents, является ключом предыдещего объекта по иерархии
  fillPercents = surfaceColors[selectSurfaceColor];

  if (selectService === "Сканирование") {
    dpiQlts = surfaceColors[selectSurfaceColor];
  }

  //Очищаем все при изменении услуги
  // Находим внешний блок, в кором произошло событие
  removeNextSiblingsAll(target);
  clearResult();

  if (selectService === "Сканирование") {
    insertDpiQlts();

    document.getElementById("dpiQlt").onchange = function() {
      changeDpiQlt();
    }
  } else {
    insertFillPercents();

    for (let i = 0; i < document.getElementsByName("fillPercent").length; i++) {
      document.getElementsByName("fillPercent")[i].onchange = function() {
        changeFillPercent();
      }
    }
  }

}


function insertFillPercents() {
  let percents;
  let label = "";
  let checked = "";
  let src = "";
  let nameLabel = selectService === "Переплет" ? "" : PARAMS.fillPercent;

  percents = Object.keys(fillPercents);

  if (percents.length < 2) {
    checked = 'checked';
  }

  percents.forEach( (percent, item) => {
    if (item === 0 && percents.length > 1) {
      src = "../img/text.jpg";
    } else if (item === 1 && percents.length > 1) {
      src = "../img/text-s-kartinkoy.jpg";
    }

    label += '<label class="form-services_label col-auto">\
                <img class="form-services_percent" src="' + src + '" alt="">\
                ' + percent + '\
                <input type="radio" ' + checked + ' name="fillPercent" value="' + percent + '">\
              </label>';
  });

  let html = '<div class="form-group row">\
                <label class="col-12 col-md-6"> ' + nameLabel + ' </label>\
                <div class="col-12 col-md-6">' + '\
                  <div class="row">\
                    ' +label + '\
                  </div>' + '\
                </div>\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);

  let target = document.getElementsByName('fillPercent')[0];

  if (percents.length < 2) {
    changeFillPercent();
    hiddenElement(target);
  }
}

function changeFillPercent() {
  let selects = document.getElementsByName("fillPercent");
  let target;

  for (var i = 0; i < selects.length; i++) {
    if (selects[i].checked) {
      target = selects[i]; break;
    }
  }

  selectFillPercent = target.value;

  // if (!selectFillPercent) return;

  selectPrice = fillPercents[selectFillPercent];

  //Очищаем все при изменении услуги
  // Находим внешний блок, в кором произошло событие
  removeNextSiblingsAll(target);
  clearResult();

  insertQtyPages();

  document.getElementById("qtyPage").onchange = function() {
    changeQtyPage();
  }

  // Количество экземпляров доступно для всех кроме следующих услуг:
  if (selectService !== "Переплет"
      && selectService !== "Ламинирование"
      && selectService !== "Натяжка на подрамник") {

    insertQtyCopies();

    document.getElementById("qtyCopy").onchange = function() {
      changeQtyCopy();
    }
  }

  insertPagesPerSheet();

  document.getElementById("pagePerSheet").onchange = function() {
    changePagePerSheet();
  }

  recalc();

}


function insertDpiQlts() {
  let options = "";
  let dpi;
  let disabled = "";
  let nameLabel = selectService === "Сканирование" ? PARAMS.dpiQlt : "";

  if (Object.keys(dpiQlts).length > 1) {
    disabled = '<option value="" disabled selected> не выбрано </option>';
  }

  for (dpi in dpiQlts) {
    options += '<option value="' + dpi + '" ' + '>' + dpi + '</option>'
  }

  let html = '<div class="form-group row">\
                <label class="col-12 col-md-6"> ' + nameLabel + ' </label>\
                <div class="col-12 col-md-6">\
                  <select id="dpiQlt" class="form-control">\
                    ' + disabled + '\
                    ' + options + '\
                  </select>\
                </div>\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);

  let target = document.getElementById('dpiQlt');

  if (Object.keys(dpiQlts).length < 2) {
    changeDpiQlt();
    hiddenElement(target);
  }
}

function changeDpiQlt() {
  let select = document.getElementById("dpiQlt");
  let target = select;

  selectDpiQlt = target.value;

  if (!selectDpiQlt) return;

  selectPrice = dpiQlts[selectDpiQlt]

  //Очищаем все при изменении услуги
  // Находим внешний блок, в кором произошло событие
  removeNextSiblingsAll(target);
  clearResult();

  insertQtyPages();

  document.getElementById("qtyPage").onchange = function() {
    changeQtyPage();
  }

  recalc();
}


function insertQtyPages() {
  let nameLabel = selectService === "Переплет" ? PARAMS.qtyBinding : PARAMS.qtyPage;

  let html = '<div class="form-group row">\
                 <label class="col-12 col-md-6" for="qtyPage"> ' + nameLabel +' </label>\
                 <input type="number" class="col-12 col-md-6" id="qtyPage" value="1" min="1">\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);
}

function changeQtyPage() {
  let select = document.getElementById("qtyPage");

  selectQtyPage = select.value;

  if (!selectQtyPage || selectQtyPage < 1) return;

  recalc();
}


function insertQtyCopies() {
  let minQty = 1;
  let nameLabel = selectService === "Переплет" ? "" : PARAMS.qtyCopy;

  if (selectService === "Ризограф") {
    minQty = 10;
    selectQtyCopy = minQty;
  }

  let html = '<div class="form-group row">\
                 <label class="col-12 col-md-6" for="qtyCopy"> ' + nameLabel + ' </label>\
                 <input type="number" class="col-12 col-md-6" id="qtyCopy" value="' + minQty + '" min="' + minQty + '">\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);
}

function changeQtyCopy() {
  let select = document.getElementById("qtyCopy");

  selectQtyCopy = select.value;

  if (!selectQtyCopy || selectQtyCopy < 1) return;

  recalc();
}


function insertPagesPerSheet() {
  let options = "";
  let paper;
  let nameLabel = selectService === "Переплет" ? "" : PARAMS.pagePerSheet;
  // isPPS - если false, то несколько страниц на листе доступно,
  // если true, то 1 стр на листе
  let isPPS = false;
  // let disabled = '<option value="" disabled selected> не выбрано </option>';

  // При следующих условиях доступна опция "страниц на листе"
  if ( (selectSize === "А4 (21х30) см" || selectSize === "А3 (30х42) см")
    && (selectType === "Простая" || selectType === "Фотобумага" || selectType === "Самоклейка")
    && (selectService === "Распечатка") ) {
    // Если ч/б печать, то берется с объекта pagesPerSheetForBlack количество стр на листе
    if (selectPrintColor === "Ч/б") {
      for (paper in pagesPerSheetForBlack) {
        options += '<option value="' + pagesPerSheetForBlack[paper] + '" ' + '>' + paper + '</option>';
      }
    } // Если ч/цветная печать, то берется с объекта pagesPerSheetForColor количество стр на листе
    else if (selectPrintColor === "Цветная") {
      for (paper in pagesPerSheetForColor) {
        options += '<option value="' + pagesPerSheetForColor[paper] + '" ' + '>' + paper + '</option>';
      }
    }
  } // Если не совпало ни одно условие, то по умолчанию 1 стр на листе
  else {
    isPPS = true;
    paper = Object.keys(pagesPerSheetForColor)[0];
    // disabled = "";
    options += '<option value="' + 1 + '" ' + '>' + paper + '</option>';
  }

  let html = '<div class="form-group row">\
                <label class="col-12 col-md-6"> ' + nameLabel + ' </label>\
                <div class="col-12 col-md-6">\
                  <select id="pagePerSheet" class="form-control">\
                    ' + options + '\
                  </select>\
                </div>\
              </div>';

  formServicesInner.insertAdjacentHTML("beforeEnd", html);

  let target = document.getElementById('pagePerSheet');

  // В случае, если одна стр на листе, то автоматически запустить следующие функции
  if (isPPS) {
    changePagePerSheet();
    hiddenElement(target);
  }
}

function changePagePerSheet() {
  let select = document.getElementById("pagePerSheet");
  let target = select;

  selectPagePerSheet = select.value;

  // if (!selectPagePerSheet) return;

  recalc();
}


function clearResult() {
  htmlSum.innerHTML = 0;
  htmlSumDiscounted.innerHTML = "";
  htmlTotalSum.innerHTML = 0;
  htmlTotalSumDiscounted.innerHTML = "";
  table.tBodies[0].innerHTML = "";

  selectDpiQlt = "";
  selectQtyPage = 1;
  selectQtyCopy = 1;
  selectPagePerSheet = 1;

  htmlSum.classList.remove("table-services_total-sum");
  htmlTotalSum.classList.remove("table-services_total-sum");
}

function isRizograf() {
  // Проверка на ризограф ли это?
  if ( (selectService === "Ксерокс" && selectQtyCopy > 99 && selectSize === "А4 (21х30) см"
   && selectType === "Простая" && selectPrintColor === "Ч/б")
   || (selectService === "Распечатка" && selectQtyCopy > 99 && selectSize === "А4 (21х30) см"
   && selectType === "Простая" && selectPrintColor === "Ч/б")
   || (selectService === "Ксерокс" && selectQtyCopy > 49 && selectSize === "А3 (30х42) см"
   && selectType === "Простая" && selectPrintColor === "Ч/б")
   || (selectService === "Распечатка" && selectQtyCopy > 49 && selectSize === "А3 (30х42) см"
   && selectType === "Простая" && selectPrintColor === "Ч/б") ) {
    alert('Сделайте просчет, выбрав опцию калькулятора, "Ризограф" \n Цена будет дешевле');
  }
}


function recalc() {
  // Очистить сумму
  htmlTotalSum.innerHTML = 0;
  htmlTotalSumDiscounted.innerHTML = "";

  let discountOrigin = 1;
  let discount = discountOrigin;
  let totalPages = 0,
      sum = 0,
      sumDiscounted = 0,
      totalSum = 0,
      totalSumDiscounted = 0;
  let html = '<tr>\
               <th>Выбранные параметры</th>\
               <th>Выбранные значения</th>\
             </tr>';;

  selectPagePerSheet = selectPagePerSheet || 1;
  selectQtyCopy = selectQtyCopy || 1;
  totalPages = Math.ceil(selectQtyPage / selectPagePerSheet) * selectQtyCopy;

  // Условия скидки
  // Условие для простой А4 ч/б печати
  if (selectService === "Распечатка"
      && selectSize === "А4 (21х30) см"
      && selectType === "Простая"
      && selectPrintColor === "Ч/б"
      && selectFillPercent === "текст") {
    if (totalPages > 4 && totalPages < 200) {
       // 50 % скидка
       discount = (100 - 50) / 100;
    } else if (totalPages > 199 && totalPages < 1000) {
      // 66 % скидка
      discount = (100 - 66.6666) / 100;
    } else if (totalPages > 999 && totalPages < 5000) {
      // 68 % скидка
      discount =(100 - 68.33333) / 100;
    } else if (totalPages > 4999) {
      // 68 % скидка
      discount = (100 - 70) / 100;
    }
  }
    // Условие для простой А4 ч/б печати с картинками
    else if (selectService === "Распечатка"
        && selectSize === "А4 (21х30) см"
        && selectType === "Простая"
        && selectPrintColor === "Ч/б"
        && selectFillPercent === "с картинками") {
      if (totalPages > 199 && totalPages < 1000) {
         // 33.33333 % скидка
         discount = (100 - 33.33333) / 100;
      } else if (totalPages > 999) {
        // 55 % скидка
        discount = (100 - 55) / 100;
      }
    }// Условие для любой цветной печати
    else if ( (selectPrintColor === "Цветная" && selectService === "Распечатка")
             || (selectPrintColor === "Цветная" && selectService === "Ксерокс")
             || selectService === "Ламинирование") {
      if (totalPages > 9 && totalPages < 50) {
         // 20 % скидка
         discount = (100 - 20) / 100;
      } else if (totalPages > 49 && totalPages < 100) {
        // 25 % скидка
        discount = (100 - 25) / 100;
      } else if (totalPages > 99 && totalPages < 500) {
        // 30 % скидка
        discount = (100 - 30) / 100;
      }

      if (totalPages > 499 || selectQtyCopy > 99) {
        // 40 % скидка
        discount = (100 - 40) / 100;
      }

      if (selectQtyCopy > 499) {
        // 45 % скидка
        discount = (100 - 45) / 100;
      }
    } // Условие для ч/б А3 печати
    else if (selectService === "Распечатка"
             && selectSize === "А3 (30х42) см"
             && selectType === "Простая"
             && selectPrintColor === "Ч/б") {
      if (totalPages > 49 && totalPages < 100) {
         // 20 % скидка
         discount = (100 - 20) / 100;
      } else if (totalPages > 99 && totalPages < 500) {
        // 30 % скидка
        discount = (100 - 30) / 100;
      } else if (totalPages > 499) {
        // 52 % скидка
        discount = (100 - 52) / 100;
      }
   }// Условие для ч/б ксерокс А3
   else if (selectService === "Ксерокс"
           && selectSize === "А3 (30х42) см"
           && selectType === "Простая"
           && selectPrintColor === "Ч/б") {
     if (totalPages > 49 && totalPages < 100) {
       // 20 % скидка
       discount = (100 - 20) / 100;
     } else if (totalPages > 99 && totalPages < 500) {
      // 25 % скидка
      discount = (100 - 25) / 100;
     } else if (totalPages > 499) {
      // 30 % скидка
      discount = (100 - 30) / 100;
     }
   }// Условие для ризографа ч/б
    else if (selectService === "Ризограф") {
      if (selectQtyCopy > 49 && selectQtyCopy < 100) {
         // 25 % скидка
         discount = (100 - 25) / 100;
      } else if (selectQtyCopy > 99 && selectQtyCopy < 500) {
        // 50 % скидка
        discount = (100 - 50) / 100;
      } else if (selectQtyCopy > 499 && selectQtyCopy < 1000) {
        // 57.50 % скидка
        discount =(100 - 57.5) / 100;
      } else if (selectQtyCopy > 999 && selectQtyCopy < 3000) {
        // 60 % скидка
        discount = (100 - 60) / 100;
      } else if (selectQtyCopy > 2999 && selectQtyCopy < 5000) {
        // 65 % скидка
        discount = (100 - 65) / 100;
      } else if (selectQtyCopy > 4999 && selectQtyCopy < 10000) {
        // 67.5 % скидка
        discount = (100 - 67.5) / 100;
      } else if (selectQtyCopy > 9999) {
        // 70 % скидка
        discount = (100 - 70) / 100;
      }
    }// Условие для твердого Переплета
    else if (selectService === "Переплет" && selectType === "Твердый (книжный)") {
      if (totalPages > 4 && totalPages < 10) {
         // 10 % скидка
         discount = (100 - 10) / 100;
      } else if (totalPages > 9 ) {
        // 20 % скидка
        discount = (100 - 20) / 100;
      }
    }// Условие для остальных услуг
    else if (selectService === "Сканирование"
            || selectService === "Натяжка на подрамник"
            || selectService === "Переплет") {
      if (totalPages > 9 && totalPages < 50) {
         // 10 % скидка
         discount = (100 - 10) / 100;
      } else if (totalPages > 49 && totalPages < 100) {
        // 20 % скидка
        discount = (100 - 20) / 100;
      } else if (totalPages > 99) {
        // 25 % скидка
        discount =(100 - 25) / 100;
      }
    }
    // -- *** ---

   // Формула просчета цены
   sum = selectPrice;
   sumDiscounted = Math.round(selectPrice * discount * 100) / 100;
   totalSum = Math.round(totalPages * selectPrice * 10) / 10;
   totalSumDiscounted = Math.round(totalPages * selectPrice * discount * 10) / 10;

   let selectData = {
     [PARAMS.nameService] : selectService,

     [selectService === "Переплет" ? PARAMS.bindingSize :
      selectService === "Натяжка на подрамник" ? PARAMS.frameSize : PARAMS.pageSize] : selectSize,

     [selectService === "Переплет" ? PARAMS.typeBinding : PARAMS.typePaper] : selectType,

     [selectService === "Переплет" ? PARAMS.weightBinding :
      selectService === "Ламинирование" ? PARAMS.weightFilm : PARAMS.weightPaper] : selectWeight,

     [selectService === "Переплет" ? PARAMS.typeCover : PARAMS.typeSurface] : selectTypeSurface,

     [PARAMS.printColor] : selectPrintColor,

     [selectService === "Переплет" ? PARAMS.coverColor : PARAMS.surfaceColor] : selectSurfaceColor,

     [PARAMS.fillPercent] : selectFillPercent,

     [selectService === "Переплет" ? PARAMS.qtyBinding : PARAMS.qtyPage] : selectQtyPage,

     [PARAMS.qtyCopy] : (selectService !== "Переплет"
         && selectService !== "Ламинирование"
         && selectService !== "Натяжка на подрамник") ? selectQtyCopy : "",

     [PARAMS.dpiQlt] : selectDpiQlt,

     [PARAMS.pagePerSheet] : (selectService !== "Переплет"
         && selectService !== "Ламинирование"
         && selectService !== "Натяжка на подрамник") ? selectPagePerSheet : ""
   };


   //Вставка данных на страницу
   // Какую цену вставить в HTML, со скидкой или нет
   // Если со скидкой, то обе цены, чтоб первую перечеркнуть
   if (discount === discountOrigin ) {
     htmlSum.innerHTML = sum;
     htmlSum.classList.remove("table-services_total-sum");

     htmlTotalSum.innerHTML = totalSum;
     htmlTotalSum.classList.remove("table-services_total-sum");
   } else {
     htmlSum.innerHTML = sum;
     htmlSum.classList.add("table-services_total-sum");
     htmlSumDiscounted.innerHTML = sumDiscounted;

     htmlTotalSum.innerHTML = totalSum;
     htmlTotalSum.classList.add("table-services_total-sum");
     htmlTotalSumDiscounted.innerHTML = totalSumDiscounted;
   }

   for (var key in selectData) {
     if (!key || !selectData[key]) continue;

     html += '<tr>\
                <td>' + key + '</td>\
                <td>' + selectData[key] + '</td>\
              </tr>';
   }

   table.tBodies[0].innerHTML = html;
   //*** - END - Вставка данных на страницу***//

   // Если количество экземпляров попадает под раздел ризограф
   isRizograf();
}


// Initialize
// Запуск всего калькулятора, т.е. вставка первых ключей основного объекта
insertNameServices();
// Вешаем на первый элемент обработчки событий
document.getElementById("nameService").onchange = function() {
  changeService();
}
