<?php
  $title = "Копирование чертежей в Копицентре &laquo;Infolio&raquo; | ксерокс больших листов | ксерокс А1, А0, А2";
  $keywords = "копирование чертежей, формат а1, размер а1, ксерокопия а2, цветная копия А2, цветное копирование А2, цветной ксерокс А2, ксерокопия А2, откопировать ватман, скопировать ватман, скопировать чертеж, как скопировать чертежи, размер а2";
  $url = "http://infolio.top/kopirovaniye-chertezhey.php";

  require_once "included/header.php";
  require_once "included/sidebar.php";
?>

  <article class="col-lg-9">
    <div class="content">
      <div class="contentTitle">
        <h4 class="text-uppercase">услуги / ксерокс широкоформатный</h4>
      </div>
      <div class="contentInner row">
        <div class="col-sm"> <!-- col-sm (Прайс печать)  -->
          <div class="itemBoxPage row">
            <div class="itemTitlePage">
              <h3>
                <span>
                  Бумага входит в стоимость распечатки.
                </span>
              </h3>
              <p>
                <strong>Широкоформатный ксерокс</strong>  - это копирование (перенос) больших форматов с бумажного носителя на бумагу с соблюдением масштаба или его изменением, т.е. увеличением или уменьшением. Ксерокс больших форматов получил популярность среди студентов, школьников, преподавателей, конструкторских бюро и др. организаций. Каждый в своей жизни что-нибудь копировал. Но ни у каждого копировального центра есть копирование больших листов. Мы можем сделать ксерокс А3, А2, А1, А0, В0 и других размеров шириной до 1м и длиной до 15 метров.
              </p>
              <p>
                Мы можем откопировать любые размеры, с любой бумаги. Часто бывает, что документы вшиты в технические паспорта и многие копицентры отказываются ксерить такие документы, «мол надо расшить».  И только у нас вы сможете <strong>скопировать</strong> документы и чертежи <strong> вшитые </strong>. Также вы можете откопировать ветхие чертежи, картины и паспорта, т.к. сканер планшетный и не протягивает через себя документ.
              </p>
              <p>
                <strong>Ксерокопирование документа с уменьшение.</strong> Это когда например у вас есть А1, а вы хотите для удобства распечатать этот большой лист на А4. Сначала его сканируют, а потом печатают на любом формате для вас.
              </p>
              <p>
                <strong>Ксерокопирование документа или картинки с увеличением.</strong> Это когда вам сканируют маленькую фотографию или документ с большим разрешением, а потом печатают на большом формате.
              </p>
              <p>
                Мы работаем уже больше 10 лет и нам люди доверяют свои документы, т.к. делаем в сроки и качественно. Также существует система скидок. Попробовав у нас сделать услугу хоть один раз, вы уже навсегда останетесь с нами.
              </p>
            </div>
            <div class="itemImagePage">
              <p>
                  <img src="price/kopirovaniye-a1.png"
                  alt="Копирование чертежей, копирование а1,
                  широкоформатное копирование"
                  title="Копирование чертежей, копирование а1,
                  широкоформатное копирование">
              </p>
            </div>
            <div class="itemDescription">
              <p>
                <span>Стоимость  других видов бумаги прибавлять к стоимости печати.</span>
              </p>
              <p>
                <span>Цены могут колебаться.</span>
              </p>
              <p>
                <span>Перед тем как заказать услугу уточните цену и сроки изготовления.</span>
              </p>
            </div>
          </div>
        </div> <!-- -END- col-sm (Прайс печать)  -->

      </div>  <!-- -END- contentInner -->
    </div> <!-- -END- content-->
  </article>


  <?php
    $scripts = array("http://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js");

    require_once "included/footer.php";
  ?>
