<?php
  $title = "Печать фото в Копицентр &laquo;Infolio&raquo; | срочное фото в Копицентр &laquo;Инфолио&raquo; | печать foto Харьков";
  $keywords = "печать фото харьков дешево, фотопечать стоимость, фотопечать а3, заказать фотографии, печать фото позняки, печать фото харьков, заказать фотопечать, печать фото формата а3, сколько стоит распечатать фотографию 10 на 15, фото 10х15, печать фото цена, фотопечать, печать фото стоимость, печать фото, сколько стоит распечатать фото а4, фотопечать дешево, цена распечатать фото, где можно распечатать фотографии, качественная печать фотографий, печать фото 10 на 15 цена, печать фото онлайн, печать больших форматов на а4, фото печать, фото распечатать цена, стоимость фото 10х15, печать на картоне харьков, распечатка на картоне харьков, где можно напечатать фото, напечатать фото харьков плехановская, где в харькове можно сделать цветную распечатку, распечатка фотографий харько, сколько стоит сделать фото 9 на 12 харьков, фото на документы харьков советская, фото распечатать харьков, самая дешевая печать фото в харькове, печать фото харьков, фотоуслуги на алексеевке, печать фото инстаграм харьков, печать фотографий в альбома с, рост холодногорский печать фото, напечатать свадебную фотокнигу в харькове, фото на документы круглосуточно харьков, распечатка фото харьков цена, печать коллажа на холсте харьков, печать фото маршала жукова, фото digital харьков героев труда, моментальная печать фотографий, печать фото с айфона харьков, фото на холсте харьков цена, типография печать флаеров, изготовление афиш, изготовление плакатов цена, изготовление постеров, распечатать фото а4 цена, фото на холсте харьков, распечатать фото харьков цена, цифровая фотопечать, фотопечать фото, фото распечатка, харьков печать фото, изготовление фотографий, фото копи центр, печать фото в харькове, печать фото онлайн харьков, напечатать фото, мгновенная печать фото, фото на документы, напечатать фото, распечатать фото с флешки, фото на паспорт харьков, фотопечать на, фото на печать, распечатать фото харьков, печать фото харьков цена, #печать, распечаткп фото, фото а3, цена фотографии 10х15, заказ печати фотографий через интернет";
  $url = "http://infolio.top/pechat-foto.php";

  require_once "included/header.php";
  require_once "included/sidebar.php";
?>

<article class="col-lg-9">
  <div class="content">
    <div class="contentTitle">
      <h4 class="text-uppercase">услуги / печать фото</h4>
    </div>
    <div class="contentInner row">
      <div class="col-sm-12"> <!-- col-sm (Прайс печать)  -->
        <div class="itemBoxPage row">
          <div class="itemTitlePage">
            <h2>
              <span>
                Стоимость распечатки в  режиме фото-качества
              </span>
            </h2>
            <h3>
              <span>
                Бумага входит в стоимость распечатки.
              </span>
            </h3>
          </div>
          <div class="itemImagePage">
            <p>
                <img src="price/pechat-sertifikatov-foto.png"
                alt="Печать фото,печать сертификатов, печать грамот"
                title="Печать фото,печать сертификатов, печать грамот">
            </p>

          </br></br>
          <p>
              <img src="price/foto-pechat-na-holste.png"
              alt="Печать фото,печать на холсте, печать картин"
              title="Печать фото,печать на холсте, печать картин">
          </p>
          </div>
          <div class="itemDescription">
            <p>
              <span>Стоимость  других видов бумаги прибавлять к стоимости печати.</span>
            </p>
            <p>
              <span>Цены могут колебаться.</span>
            </p>
            <p>
              <span>Перед тем как заказать услугу уточните цену и сроки изготовления.</span>
            </p>
          </div>
        </div>
      </div> <!-- -END- col-sm (Прайс печать)  -->

      <div class="col-sm-12"> <!-- col-sm (Прайс печать)  -->
        <div class="itemBoxPage row">
          <div class="itemTitlePage">
            <h2>
              <span>
                Новинка !!!
              </span>
            </h2>
            <h3>
              <span>
                Печать фото под полароид и под инстаграм
              </span>
            </h3>
          </div>
          <div class="itemImagePage">
            <p>
                <img src="img/polaroid.jpg"
                alt="Печать фото полароид, печать фото инстаграм, друк фото інстаграм"
                title="Печать фото полароид, печать фото инстаграм, друк фото інстаграм">
            </p>
          </div>

        </div>
      </div> <!-- -END- col-sm (Прайс печать)  -->

      <div class="col-sm-12"> <!-- col-sm (Прайс печать)  -->
        <div class="itemBoxPage row">
          <div class="itemTitlePage">
            <h2>
              <span>
                Новинка !!!
              </span>
            </h2>
            <h3>
              <span>
                Печать фото для альбомов мечты и дневников желаний
              </span>
            </h3>
          </div>
          <div class="itemImagePage">
            <p>
                <img src="img/albom-zhelaniy.jpg"
                alt="Печать для альбома мечты, печать фото желаний"
                title="Печать для альбома мечты, печать фото желаний, друк альбома бажань">
            </p>
          </div>
          <div class="itemDescription">
            <p>
              <span>Стоимость  других видов бумаги прибавлять к стоимости печати.</span>
            </p>
            <p>
              <span>Цены могут колебаться.</span>
            </p>
            <p>
              <span>Перед тем как заказать услугу уточните цену и сроки изготовления.</span>
            </p>
          </div>
        </div>
      </div> <!-- -END- col-sm (Прайс печать)  -->

    </div>  <!-- -END- contentInner -->
  </div> <!-- -END- content-->
</article>

<?php
  $scripts = array("http://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js");

  require_once "included/footer.php";
?>
