<?php
  $title = "Широкоформатная печать - Копицентр &laquo;Инфолио&raquo; | Печать на ватмане в Харькове | Печать цветная А1, А2, А0, В0 | метровые плакаты";
  $keywords = "дешевая широкоформатная печать, формат а1, широкоформатный, где можно напечатать плакат, плоттер печать, печать плакатов дешево, широкоформатная цифровая печать, печать плакатов, печать плаката а2, печать плаката, широкоформатная печать без выходных, печать плакатов формата а1, печать плакатов больших размеров, цены на печать плакатов, печать на холсте харьков, цветная печать плакатов, печать фото большого формата, где в харькове можно вечером распечатать цветной ватман, печать а0 харьков, широкоформатная рапечатка на конном рынке, печать а1 харьков цена, ватман размер см харьков, фотоколлаж заказать не дорого украина, широкоформатная печать харьков, плакаты заказать, печать а1 харьков, печать на а2, печать а1, фото плакат на заказ, заказать плакат харьков, печать чертежей, заказать плакат с фото, широкоформатная печать харьков цена, плакат заказать, бумага а1 купить, полиграфия а2, изготовление рекламных плакатов, а1, печать фото большого формата";
  $url = "http://infolio.top/pechat-shirokoformatnaya.php";

  require_once "included/header.php";
  require_once "included/sidebar.php";
?>

<article class="col-lg-9">
  <div class="content">
    <div class="contentTitle">
      <h4 class="text-uppercase">услуги / широкоформатная печать</h4>
    </div>
    <div class="contentInner row">
      <div class="col-sm"> <!-- col-sm (Прайс печать)  -->
        <div class="itemBoxPage row">
          <div class="itemTitlePage">
            <h2>
              <span>

              </span>
            </h2>
            <h3>
              <span>
                Бумага НЕ входит в стоимость распечатки.
              </span>
            </h3>
          </div>
          <div class="itemImagePage">
            <p>
                <img src="price/pechat-plakatov.png"
                alt="Печать широкоформатная, печать плакатов, чертежей,
                печать плакатов А0, печать плакатов А1, печать плакатов А2,
                печать плакатов А0+"
                title="Печать широкоформатная, печать плакатов, чертежей,
                печать плакатов А0, печать плакатов А1, печать плакатов А2,
                печать плакатов А0+">
            </p>
          </div>
          <div class="itemDescription">
            <p>
              <span>Стоимость  других видов бумаги прибавлять к стоимости печати.</span>
            </p>
            <p>
              <span>Цены могут колебаться.</span>
            </p>
            <p>
              <span>Перед тем как заказать услугу уточните цену и сроки изготовления.</span>
            </p>
          </div>
        </div>
      </div> <!-- -END- col-sm (Прайс печать)  -->

    </div>  <!-- -END- contentInner -->
  </div> <!-- -END- content-->
</article>

<?php
  $scripts = array("http://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js");

  require_once "included/footer.php";
?>
