<?php
  $title = "Печать ч/б в Копицентр &laquo;Infolio&raquo; | Распечатка в Копицентр &laquo;Инфолио&raquo; Харькове | Распечатка ч/б | Печать диссертаций";
  $keywords = "автореферати дисертацій, диссертации, цифровая печать каталогов, печать листовок а4 дешево, печатают, где можно напечатать плакат,  диссертацию, печать листовок харьков, автореферат диссертации, распечатка, распечатка документов, цена печати а4, печать а 4, a4 формат, printing, print, печатать, диссертация, напечатать, распечатка, распечатать, черно белая печать, типография печать а3, печать харьков, печать авторефератов с указанием свидетельства издания, печать московский проспект, печать пробная, сколько стоит распечатка харьков, печятать, стоимость печати и сканирования, печать конвертов харьков, печать на принтере дешево харьков, роспечатать и прошить деплом по харькову, вечером распечатать, рапечатка рымарская харьков, распечатка на акварельной бумаге, печать круглосуточно харьков, напечатать с утра, печатать с утра, распечатать на пушкинской с 8 утра, распечатать с утра, харьков печать утром, печать лазерная а4 харьков, сколько стоит распечатка на а3 харьков, печать архитектурные проекты харьков, распечатать с флешки и расплатится с карты, печать бланков харьков, распечатать с телефона харьков, распечатка на а3, где можно распечатать электронный билет на автобус, типография харьков университет, альфа груп печать на практику харьков, распечатка харьков круглосуточно, распечатка харьков 23 августа, распечвтка одеская харьков, распечвтка одеская харьков вавилон, цены на печать харьков, распечатка харьков аэропорт, харьков круглосуточная печать, infolio харьков печать, распечатка а4 цена, распечатка цветная, изготовление листовок, распечатать документы, печать дешево, оперативна поліграфія, печать листовок типография, распечатать на а3, сделать печать харьков, дешевая цифровая печать, +печать +харьков, стоимость распечатки, поліграфія, листовки печать изготовление, типография печать а4, цена печати, сколько стоит распечатать документ, печать а3, цифровая печать типография, печать онлайн, распечатать файл, ксерокс печать, печать а4, заказать на печать харьков, бумага а 4, стоимость печати, печать в харькове, образцы печати, печать дипломной работы, распечатка а3 цена, типография распечатка, распечатка харьков, +напечатать +в +харькове, сколько стоит печать листа а4, типография а4, дом печати харьков";
  $url = "http://infolio.top/pechat.php";

  require_once "included/header.php";
  require_once "included/sidebar.php";
?>

<article class="col-lg-9">
  <div class="content">
    <div class="contentTitle">
      <h4 class="text-uppercase">услуги / печать</h4>
    </div>
    <div class="contentInner row">
      <div class="col-xsm-12"> <!-- col-sm (Прайс печать)  -->
        <div class="itemBoxPage row">
          <div class="itemDescription">
            <p>
              Копицентр «Инфолио» предлагает все виды распечатки.
              В данном разделе  указаны цены на черно-белую печатную продукцию:
              брошюры, печать диссертаций, авторефераты, книги, листовки,
              рефераты, курсовые,  дипломные работы, магистерские работы и просто документы.
              Печать есть цифровая лазерная и струйная.
            </p>
          </div>
          <div class="itemTitlePage">
            <h2>Стоимость распечатки А4 ч/б на бумаге 80 г/м2.</h2>
            <h3>Бумага входит в стоимость распечатки.</h3>
          </div>
          <div class="itemImagePage">
            <p>
                <img src="price/raspechatka.png"
                  alt="Печать, распечатка, печать харьков,
                  печать авторефератов, печать диссертаций"
                  title="Печать, распечатка, печать харьков,
                  печать авторефератов, печать диссертаций">
            </p>
          </div>

          <div class="itemTitlePage">
            <h2>Стоимость распечатки А3 ч/б</h2>
            <h3>Бумага входит в стоимость распечатки.</h3>
          </div>
          <div class="itemImagePage">
            <p>
                <img src="price/raspechatka-a3.png"
                  alt="Печать а3, распечатка а3, печать а3 харьков,
                  распечатать автореферат, распечатать диссертации"
                  title="Печать а3, распечатка а3, печать а3 харьков,
                  распечатать автореферат, распечатать диссертации">
            </p>
          </div>

          <div class="itemDescription">
            <p>
              <strong>Стоимость  других видов бумаги прибавлять к стоимости печати.</strong>
            </p>
            <p>
              <strong>Цены могут колебаться.</strong>
            </p>
            <p>
              <strong>Перед тем как заказать услугу уточните цену и сроки изготовления.</strong>
            </p>
          </div>
        </div>
      </div> <!-- -END- col-sm (Прайс печать)  -->

      <div class="col-xsm-12 col-sm-6"> <!-- col-xsm-6   -->
        <div class="itemBoxPage row">
          <div class="itemTitlePage">
            <h2>Печать авторефератов для диссертаций.</h2>
          </div>
          <div class="itemImagePage offset-3 col-xsm-6">
              <img src="img/avtoreferat.png"
                alt="Печать ч/б, распечатка авторефераты, печать харьков,
                печать авторефератов, печать диссертаций"
                title="Печать ч/б, распечатка авторефераты, печать харьков,
                печать авторефератов, печать диссертаций">
          </div>
          <div class="itemDescription">
            <p>
              Мы оказываем услуги по изготовлению авторефератов. Указываем все необходимые реквизиты.
              Печать в кратчайшие сроки. Также можно заказть срочную распечатку.
            </p>
          </div>
        </div>
      </div> <!-- -END- col-xsm-6 -->

      <div class="col-xsm-12 col-sm-6"> <!-- col-xsm-6   -->
        <div class="itemBoxPage row">
          <div class="itemTitlePage">
            <h2>Печать диссертаций ч/б и цветным</h2>
          </div>
          <div class="itemImagePage offset-3 col-xsm-6">
              <img src="img/pereplet-dissertatsiy.jpg"
                alt="печать диссертаций"
                title="печать диссертаций">
          </div>
          <div class="itemDescription">
            <p>
              Мы печатаем и прошиваем диссертации.
              Печать в кратчайшие сроки. Также можно заказть срочную распечатку.
            </p>
          </div>
        </div>
      </div> <!-- -END- col-xsm-6 -->


    </div>  <!-- -END- contentInner -->
  </div> <!-- -END- content-->
</article>

<?php
  $links = array("<link rel='stylesheet' type='text/css' href='css/modal_window.css' />");
  $scripts = array("http://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js",
                  "js/modal_window.js");

  require_once "included/footer.php";
?>
