<?php
  $title = "Правила заказа в Копицентр &laquo;Infolio&raquo; | Как закать улуги в Копицентр &laquo;Инфолио&raquo; | Правила заказа полиграфии | Перед тем как заказать печать";
  $keywords = "правила заказа в копицентре инфолио, как закать в копицентре, условия заказа, устав копицентра, устав копицентра инфолио, как оформить заказ, как сделать заказ онлайн, правила в копицентре, устав копировального центра";
  $url = "http://infolio.top/pravila-zakaza.php";

  require_once "included/header.php";
  require_once "included/sidebar.php";
?>



<article class="col-lg-9">
  <div class="content">

    <div class="contentTitle"> <!-- -->
      <h4 class="text-uppercase">Правила заказа</h4>
    </div>

    <div class="contentInner row">
      <div class="col-sm"> <!-- col-sm (Одна карточка)  -->
        <div class="itemBoxPage row">
          <div class="itemTitlePage">
            <h4>Как подготовить файл к печати (как сохранить в pdf)</h4>
          </div>
          <div class="itemImagePage col-md-6">
            <div class="embed-responsive embed-responsive-4by3">
              <iframe width="560" height="315"
                src="https://www.youtube.com/embed/791XaTeOOTQ?rel=0" frameborder="0"
                allow="autoplay; encrypted-media" allowfullscreen>
              </iframe>
            </div>
          </div>
          <div class="itemDescription col-md-6">
            <p>
              Экономьте ваше и наше время для того чтоб быстро
              и качественно распечатать чертежи плакаты, курсовые
              или дипломы используйте PDF конвертер
              установить его очень просто, и тогда ни таблицы
              ни рисунки, ни текст не изменит ни своего вида,
              ни положения. Чтоб воспользоваться PDF конвертерером
              необходимо скачать PDFcreator любой версии
              он абсолютно бесплатный. После чего в любой программе он появляется в
              виде виртуального принтера, т. е. в программе
              нажимаете печать и в перечне принтеров
              выбираем PDFcreator., жмем печать и в
              следующем  открывшемся окне указываем,
              где сохранить создаваемый файл PDF.
              Если у вас нет возможности принести файл для
              распечатки на носителе, либо находитесь
              в другом городе вы можете сбросить информацию
              на электронную почту: infolio2009@ukr.net.
            </p>
            <a href="http://download.pdfforge.org/download/pdfcreator/PDFCreator-stable">Скачать PDFCreator...</a>
            <p>При нажатии "скачать" подождите несколько секунд...Загрузка начнется автоматически...</p>
          </div>

          <div class="itemTitlePage">
            <h3>Правила работы копировального центра «INFOLIO»</h3>
            <h6>Все пожелания клиента не описанные в прайсе обсуждаются и оцениваются оператором на его усмотрение на момент заказа услуги</h6>
          </div>
          <div class="itemDescription">

              <pre>
              1. Вежливость.

              Важным фактором хорошей работы организации есть моральный комфорт.
              Повышение голоса и грубые слова выводят работника из рабочего состояния,
              что отражается на его собранности, сроках и качестве выполнения заказов.

              Но есть категория людей, считающих: «если я поскандалю - мне сделают
              скидку», или «надо тут всем рассказать как они должны работать». С такими
              «клиентами» мы не работаем.


              2. Предоставление информации.

              Работник, обязанностью которого есть - предоставить всю информацию о
              услугах и ценах организации, в которой нуждается заказчик.

              Но работник копировального центра «INFOLIO» не владеет информацией о
              услугах других организаций. Также мы не даем информации «как что-то из
              наших услуг Вам сделать самостоятельно».


              3.    В рабочую зону заходить нельзя.

              Часто заказчик не желает публичности своей печатной продукции. С целью
              сбережения конфиденциальности изготовленной полиграфической продукции
              заказчиков и неприкосновенности материальных ценностей копировального
              центра «INFOLIO»просим Вас не заходить в рабочую зону.

              4.    Мы не печатаем документы с печатями подписями или другими
              защитными знаками.

              Печать—это защитный знак, который должен передаваться на бумагу с помощью
              специального клише и чернила. А переносить цветную печать на бумагу с
              помощью принтера - это подделка печати, которая запрещена законом.

              В соответствии с законодательством Украины ст. 358 УК, цветная распечатка
              защитных знаков возможна только с полупрозрачной подписью «Копия» через
              весь лист документа.

              5.    Тексты нужно подавать в письменном виде.

              Иногда заказчик желает надиктовать информацию, требующую точной записи.
              Диктуя, заказчик может что-то упустить, а менеджер может записать не верно.
              Результат - переделка сделанной работы. Поэтому, во избежание переделок
              просим присылать материалы со всеми комментариями по электронной почте
              infolio2009@ukr.net, или писать на листе бумаги придя к нам в офис.

              6. У нас нет свободных компьютеров?

              Время от времени наши заказчики проявляют желание самостоятельно
              воспользоваться нашими компьютерами. Но так как нахождение заказчика в
              рабочей зоне запрещено и все компьютеры полиграфии закреплены за
              работниками, деятельность которых без них невозможна, мы вынуждены
              отказывать в подобных просьбах.

              7.    Мы работаем по предоплате.

              Точкой отсчета времени изготовления полиграфической продукции является
              момент предоставления/утверждения макета и внесения предоплаты.

              Оплачивать можно:

              -    наличными, придя в офис,

              -    безналичным расчетом через ближайший к Вам банк,

              -    попросить внести предоплату другого человека, который имеет больше
              времени или будет возле нас проездом.

              8.    Для печати любой полиграфической продукции нужен макет.

              Макет это не нарисованная от руки или набранная в MS Word схема визитки,
              макет — это разработанный в специализированных программах электронный
              вид полиграфического изделия (масштаб 1:1). Макет не просто должен
              выглядеть хорошо, он должен быть понятным для полиграфического
              оборудования.

              Разработку макетов делают дизайнеры полиграфии - специально обученные
              люди, знающие законы композиции, полиграфические технологии, программы
              для работы с графикой и имеющие практический опыт в разработке макетов.

              Если макеты, поданные заказчиком, не соответствуют «требованиям к макетам
              по данной полиграфической продукции», печатные материалы могут
              изготавливаться с дефектами, за которые копировальный центр «INFOLIO»
              ответственности не несет.

              9.    Все макеты утверждаются.

              Все макеты, изготовленные копировальным центром «INFOLIO» проходят
              процедуру "утверждения макета заказчиком".

              Утверждение макета заказчиком - это проверка внешнего вида и текстового
              наполнения макета заказчиком и выражение согласия к печати
              полиграфического изделия в письменном виде или по электронной почте.

              После утверждения макета заказчиком, ответственность за все ошибки в
              утвержденном макете несет заказчик. Копировальный центр «INFOLIO»
              несет ответственность только за соответствие макета техническим
              требованиям для печати и качественную его печать.

              10.    Стоимость услуг дизайнера не включена в стоимость изготовления
              полиграфической продукции.

              Стоимость разработки макета зависит от сложности работы дизайнера,
              времени, потраченного на изготовления макета и того, будет он
              использоваться на нашей полиграфии или за ее пределами.

              Когда заказчик подает материалы для разработки (доработки) макета, ему
              озвучивается внутренняя стоимость макета зависимо от его сложности.

              Дизайнер делает макет в соответствии с пожеланиями заказчика. Если
              производится доработка макета по причине изменения пожеланий заказчика -
              стоимость макета изменяется в зависимости от сложности его доработки.

              Заказчик оплачивает всю работу, которую делает дизайнер по его заказу.
              Нельзя заказать макет и когда он готов - передумать, как нельзя заказать
              шашлык, а когда его подали - решить ужинать дома. Единственной причиной
              отказа от выполненной дизайнером работы может быть брак, но брака быть не
              может так как качество макета оценивается соответствием техническим
              требованиям для печати, которым мы всегда следуем на 100%. Причина "не то
              что я хотел увидеть" может быть только причиной доработки макета.

              Все макеты, разработанные нашим дизайнером хранятся в течении 12 месяцев
              с момента последнего заказа. Если заказчик желает забрать исходный вариант
              макета и использовать его по своему усмотрению, он должен оплатить
              внешнюю стоимость макета, которая равняется двум внутренним его
              стоимостям.

              Набор текста и редактирования осуществляется в указанные сроки оператором,
              только в свободное время, срочного редактирования и набора нет.
              Оплата производится вне зависимости от результат, т.е.
              такие слова как : "Ой я не то диктовал" или "Мне не нравиться что-то" или
              "Я не помню пароль к своему аккаунту" - НЕ ПРИНИМАЮТСЯ!
              Оплата производится за каждую минуту потраченного времени.

              11.    Мы можем работать "по договоренности" в нерабочее время.

              Часто у наших заказчиков возникает необходимость на выходных, поздно
              вечером или рано утром воспользоваться нашими услугами. Мы рады будем
              пойти Вам на встречу. Стоимость выхода работника в не рабочее дневное
              время (до открытия) +50 грн. к стоимости заказа,
              в ночное время (после закрытия) +50%,
              но не менее 200 грн. Стоимость ожидания после закрытия
              опаздывающего заказчика -600 грн./час.
            </pre>

          </div>
        </div>
      </div> <!-- -END- col-sm (Одна карточка)  -->

    </div>  <!-- -END- contentInner -->
  </div> <!-- -END- content-->
</article>


<?php
  $scripts = array("http://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js");

  require_once "included/footer.php";
?>
