<?php
  $title = "Можно РАЗламинировать в Копицентр &laquo;Infolio&raquo; | Разламинация в Копицентр &laquo;Инфолио&raquo; | Разламинировать документы";
  $keywords = "разламинировать, разламінувати свідоцтво, разламинация документов, разламинировать документ, разламинировать диплом, разламинировать свидетельство, разламинировать паспорт, разламинировать пропуск, разлами диплом, снять пленку, снять ламинат, снять ламинацию, убрать пленку, убрать ламинат с документа";
  $url = "http://infolio.top/razlaminirovat.php";

  require_once "included/header.php";
  require_once "included/sidebar.php";
?>

<article class="col-lg-9">
  <div class="content">
    <div class="contentTitle">
      <h4 class="text-uppercase">услуги / разламинирование</h4>
    </div>
    <div class="contentInner row">
      <div class="col-sm"> <!-- col-sm (Прайс печать)  -->
        <div class="itemBoxPage row">
          <div class="itemTitlePage">
            <h2> Разламинирование документов </h2>
          </div>
          <div class="itemImagePage">
            <p>
                <img src="../img/razlaminirovat.jpg"
                alt="Разламинирование, снять пленку с документа"
                title="Разламинирование">
            </p>
          </div>
          <div class="itemDescription">
            <p>
              Очень часто нам необходимо заламинировать документы,
              свидетельства о рождении,
              пропуск, свидетельство о смерти, свидетельство о браке и др. документы.
              Это необходимо для защиты наших документов от разрушения. Но
              потом мы сталкиваемся с проблемой в разных инстанциях и службах, что
              нужно обратно разламинировать документ. Для чего это нужно? Во-первых для
              того чтобы проверить на подлинность свидетельство или грамоту или диплом.
              Во-вторых поставить на эти документы печать или апостильб.
            </p>
            <p>
              Поэтому при выезде за границу требуют снять все защитные пленки
               с паспорта или свидетельства о рождении ребенка. Что бы ни попасть в
               такую неприятность нужно заранее побеспокоиться.
            </p>
            <p>
              Да вы конечно можете снять пленку с помощью подручных средств. Но есть
              большая вероятность того, что вы повредите документ.
              Некоторые умельцы предлагают снимать пленку с помощью утюга,
              фена, газовой плиты и др. Но еще раз повторяю, что если будет
              температура выше, то пойдут пузыри по документу. Если температура
              будет ниже оптимальной, то пленка отдерется вместе с бумагой.
            </p>
            <p>
              После всего вышесказанного, я думаю, вы не станете экспериментировать
              над своим документом и обратитесь к профессионалам. У нас в
              копировальном центре "Infolio" работают люди с 10 летним стажем и смогут
              выполнить ваш заказ быстро и качественно. При этом вы сэкономите время и
              нервы. А как известно время - это деньги, а нервные клетки не восстанавливаются :).
            </p>
            <p>
              <b>Стоимость одной тосроны -  200 грн.</b>
            </p>
            <p>
              <b>Стоимость двух сторон -  400 грн.</b>
            </p>
            <p>
              <b>Стоимость одной стороны с галограммой, с фото или ветхий документ - 300 грн.</b>
            </p>

            <p>
              <b>Цены могут колебаться.</b>
            </p>
            <p>
              <b>Перед тем как заказать услугу уточните цену и сроки изготовления.</b>
            </p>
          </div>
        </div>
      </div> <!-- -END- col-sm (Прайс печать)  -->

    </div>  <!-- -END- contentInner -->
  </div> <!-- -END- content-->
</article>

<?php
  $scripts = array("http://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js");

  require_once "included/footer.php";
?>
