<?php
  $title = "Ризограф (размножить) в Копицентр &laquo;Infolio&raquo; | Тираж в Копицентр &laquo;Инфолио&raquo; | Любое тиражирование в Харькове";
  $keywords = "ризограф, услуги ризографа харьков, без выходных, ксерокс, ризограф печать, різограф, ризограф харьков, размножить документы, отризографировать, а3, откопировать в типографии, размножить документы";
  $url = "http://infolio.top/rizograf.php";

  require_once "included/header.php";
  require_once "included/sidebar.php";
?>

<article class="col-lg-9">
  <div class="content">
    <div class="contentTitle">
      <h4 class="text-uppercase">услуги / ризограф</h4>
    </div>
    <div class="contentInner row">
      <div class="col-sm"> <!-- col-sm (Прайс печать)  -->
        <div class="itemBoxPage row">
          <div class="itemDescription">
            <p>
              <strong>Ризограф</strong> произошел от названия Японской фирмы Riso Kagaku Corporation. Это печатная машина, копир, цифровая система печати и работает по принципу использования метода трафаретной печати краской. Грубо, говоря это быстрый ксерокс. Тиражирование на этом аппарате выгодно только при копировании большого количества экземпляров одного и того же листа. Некоторые люди думают что можно сказать: «сделайте несколько листиков в нескольких экземплярах» и называют это ризографом. Но это не так! Почему цена дешевле на ризографе? Она дешевле только при большом количестве экземпляров. При маленьком количестве цена может быть дороже ксерокса, т.к. при копировании на ризографе изготавливается клеше. Бывают ризографы разноцветные. У нас есть возможность сделать ризографию только одним цветом – черным.
            </p>
          </div>

          <div class="itemTitlePage">
            <h2>Стоимость ризографа А4 ч/б на бумаге 80 г/см2.</h2>
            <h3>Бумага входит в стоимость ризографа.</h3>
          </div>
          <div class="itemImagePage">
            <p>
                <img src="price/tirazhirovaniye.png"
                  alt="Ризограф, тиражирование, ризография"
                  title="Ризограф, тиражирование, ризография">
            </p>
          </div>

          <div class="itemTitlePage">
            <h2>Стоимость ризографа А3 ч/б на бумаге 80 г/см2.</h2>
            <h3>Бумага входит в стоимость ризографа.</h3>
          </div>
          <div class="itemImagePage">
            <p>
                <img src="price/rizograf-a3.png"
                  alt="Ризограф, тиражирование, ризография"
                  title="Ризограф, тиражирование, ризография">
            </p>
          </div>

          <div class="itemDescription">
            <p>
              <strong>Стоимость  других видов бумаги прибавлять к стоимости печати.</strong>
            </p>
            <p>
              <strong>Цены могут колебаться.</strong>
            </p>
            <p>
              <strong>Перед тем как заказать услугу уточните цену и сроки изготовления.</strong>
            </p>
          </div>
        </div>
      </div> <!-- -END- col-sm (Прайс печать)  -->

    </div>  <!-- -END- contentInner -->
  </div> <!-- -END- content-->
</article>

<?php
  $scripts = array("http://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js");

  require_once "included/footer.php";
?>
